## top template

### github
- jupyter notebook形式のファイルは[こちら](https://github.com/hiroshi0530/wa-src/blob/master/article/library/scipy/template/template_nb.ipynb)

### google colaboratory
- google colaboratory で実行する場合は[こちら](https://colab.research.google.com/github/hiroshi0530/wa-src/blob/master/article/library/scipy/template/template_nb.ipynb)

### 筆者の環境
筆者のOSはmacOSです。LinuxやUnixのコマンドとはオプションが異なります。

In [ ]:
!sw_vers

In [ ]:
!python -V

基本的なライブラリをインポートしそのバージョンを確認しておきます。

In [1]:
%matplotlib inline
%config InlineBackend.figure_format = 'svg'

import matplotlib
import matplotlib.pyplot as plt
import scipy
import numpy as np

print('matplotlib version :', matplotlib.__version__)
print('scipy version :', scipy.__version__)
print('numpy version :', np.__version__)

matplotlib version : 3.8.1
scipy version : 1.11.2
numpy version : 1.25.2

In [2]:
import sqlite3

In [6]:
%config SqlMagic.autopandas = True
%config SqlMagic.feedback = True
%load_ext sql

In [7]:
import os

if os.path.exists("data.db"):
    os.system("rm data.db")
os.system("touch data.db")

!chmod 664 data.db

In [4]:
with sqlite3.connect("data.db") as conn:
    cur = conn.cursor()

    # テーブル一覧を取得
    cur.execute(
        """
        SELECT name FROM sqlite_master WHERE type='table';
    """
    )

    table_list = cur.fetchall()

    print(table_list)

    cur.close()

[('ProductCode',), ('sqlite_sequence',)]

In [8]:
%sql sqlite:///data.db

In [23]:
%%sql

with data as (
    select "test1" as A, "test" as B, "AA" as C
    UNION ALL
    select "test1" as A, "test" as B, "AA" as C
    UNION ALL
    select "test2" as A, "test9" as B, "AA" as C
    UNION ALL
    select "test3" as A, "test9" as B, "AA" as C
)

select
    A, B, "ABC" as ZZZ
from
    data
GROUP BY 1, 2, 3

 * sqlite:///data.db
Done.

       A      B  ZZZ
0  test1   test  ABC
1  test2  test9  ABC
2  test3  test9  ABC

In [5]:
%%sql

create table ProductCode (
    商品番号 INTEGER PRIMARY KEY AUTOINCREMENT,
    商品名 TEXT
);

 * sqlite:///data.db
Done.

Empty DataFrame
Columns: []
Index: []

In [6]:
%%sql

insert into ProductCode(商品名) values('ノート');
insert into ProductCode(商品名) values('鉛筆');
insert into ProductCode(商品名) values('赤鉛筆');
insert into ProductCode(商品名) values('ボールペン');
insert into ProductCode(商品名) values('シャープペンシル');
insert into ProductCode(商品名) values('消しゴム');

 * sqlite:///data.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

Empty DataFrame
Columns: []
Index: []

In [7]:
%%sql
select * from ProductCode;

 * sqlite:///data.db
Done.

   商品番号       商品名
0     1       ノート
1     2        鉛筆
2     3       赤鉛筆
3     4     ボールペン
4     5  シャープペンシル
5     6      消しゴム